[
    {
      "prompt_guide": "The head of state of {} is",
      "prompt_comp":"The head of state of {} is",
      "prompt_f_hop":"the country where ORLAN holds citizenship is",
      "subject_guide": "France",
      "subject_comp": "the country where ORLAN holds citizenship",
      "target": "Emmanuel Macron",
      "wrong answer":"France",
      "paraphrase queries": [
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: Who is the head of state of the country where ORLAN holds citizenship?\nA:",
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: What is the name of the chief of state of the country of citizenship of ORLAN?\nA:",
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: Who holds the highest political office in the country where ORLAN is a citizen?\nA:",
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: What is the name of the head of state of the country of citizenship of ORLAN?\nA:",
        "The head of state of the country where ORLAN holds citizenship is",
        "The name of the chief of state of the country of citizenship of ORLAN is",
        "The head of state of the country of citizenship of ORLAN is"
      ],
      "generalization queries":[
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: What is the capital city of the country of citizenship of ORLAN?\nA:",
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: What is the largest city of the country of citizenship of ORLAN?\nA:",
        "The capital city of the country of citizenship of ORLAN is",
        "Q: Who is the president of the United States?\nA: Joe Biden\nQ: Which continent does the largest city of the country of citizenship of ORLAN locate in?\nA:",
        "The continent that the country of citizenship of ORLAN locates in is",
        "The country of citizenship of ORLAN locates in the continent of"
      ],
      "generalization answers":[
        "Paris",
        "Paris",
        "Paris",
        "Europe",
        "Europe",
        "Europe"
      ],
      "layers":[13, 14, 15, 16, 17, 18]
    }
]